docs/test/results/20260321/k6-knee/comment-vus150-after-seed.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 45s max duration (incl. graceful stop):
              * default: 150 looping VUs for 15s (gracefulStop: 30s)


running (00.9s), 150/150 VUs, 169 complete and 0 interrupted iterations
default   [   6% ] 150 VUs  00.9s/15s

running (01.9s), 150/150 VUs, 538 complete and 0 interrupted iterations
default   [  13% ] 150 VUs  01.9s/15s

running (02.9s), 150/150 VUs, 992 complete and 0 interrupted iterations
default   [  19% ] 150 VUs  02.9s/15s

running (03.9s), 150/150 VUs, 1690 complete and 0 interrupted iterations
default   [  26% ] 150 VUs  03.9s/15s

running (04.9s), 150/150 VUs, 2253 complete and 0 interrupted iterations
default   [  33% ] 150 VUs  04.9s/15s

running (05.9s), 150/150 VUs, 2725 complete and 0 interrupted iterations
default   [  39% ] 150 VUs  05.9s/15s

running (06.9s), 150/150 VUs, 3147 complete and 0 interrupted iterations
default   [  46% ] 150 VUs  06.9s/15s

running (09.9s), 150/150 VUs, 3545 complete and 0 interrupted iterations
default   [  53% ] 150 VUs  07.9s/15s

running (10.9s), 150/150 VUs, 4090 complete and 0 interrupted iterations
default   [  59% ] 150 VUs  08.9s/15s

running (11.9s), 150/150 VUs, 4695 complete and 0 interrupted iterations
default   [  66% ] 150 VUs  09.9s/15s

running (12.9s), 150/150 VUs, 5424 complete and 0 interrupted iterations
default   [  73% ] 150 VUs  10.9s/15s

running (13.9s), 150/150 VUs, 6123 complete and 0 interrupted iterations
default   [  79% ] 150 VUs  11.9s/15s

running (14.9s), 150/150 VUs, 6783 complete and 0 interrupted iterations
default   [  86% ] 150 VUs  12.9s/15s

running (15.9s), 150/150 VUs, 7529 complete and 0 interrupted iterations
default   [  93% ] 150 VUs  13.9s/15s

running (16.9s), 150/150 VUs, 8075 complete and 0 interrupted iterations
default   [  99% ] 150 VUs  14.9s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 8299    481.966527/s
    checks_succeeded...: 100.00% 8299 out of 8299
    checks_failed......: 0.00%   0 out of 8299

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=307.47ms min=13ms    med=265.09ms max=2.94s p(90)=474.3ms  p(95)=632.41ms p(99)=1.56s   
      { expected_response:true }...: avg=307.47ms min=13ms    med=265.09ms max=2.94s p(90)=474.3ms  p(95)=632.41ms p(99)=1.56s   
    http_req_failed................: 0.00%  0 out of 8299
    http_reqs......................: 8299   481.966527/s

    EXECUTION
    iteration_duration.............: avg=272.04ms min=13.11ms med=265.17ms max=1.62s p(90)=448.47ms p(95)=535.36ms p(99)=783.44ms
    iterations.....................: 8299   481.966527/s
    vus............................: 150    min=150       max=150
    vus_max........................: 150    min=150       max=150

    NETWORK
    data_received..................: 270 MB 16 MB/s
    data_sent......................: 1.2 MB 72 kB/s



running (17.2s), 000/150 VUs, 8299 complete and 0 interrupted iterations
default ✓ [ 100% ] 150 VUs  15s