docs/test/results/20260321/k6-knee/comment-vus150.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 45s max duration (incl. graceful stop):
              * default: 150 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 150/150 VUs, 598 complete and 0 interrupted iterations
default   [   6% ] 150 VUs  01.0s/15s

running (02.0s), 150/150 VUs, 1419 complete and 0 interrupted iterations
default   [  13% ] 150 VUs  02.0s/15s

running (03.0s), 150/150 VUs, 2333 complete and 0 interrupted iterations
default   [  20% ] 150 VUs  03.0s/15s

running (04.0s), 150/150 VUs, 3297 complete and 0 interrupted iterations
default   [  26% ] 150 VUs  04.0s/15s

running (05.0s), 150/150 VUs, 4165 complete and 0 interrupted iterations
default   [  33% ] 150 VUs  05.0s/15s

running (06.0s), 150/150 VUs, 5079 complete and 0 interrupted iterations
default   [  40% ] 150 VUs  06.0s/15s

running (07.0s), 150/150 VUs, 5933 complete and 0 interrupted iterations
default   [  46% ] 150 VUs  07.0s/15s

running (08.0s), 150/150 VUs, 6725 complete and 0 interrupted iterations
default   [  53% ] 150 VUs  08.0s/15s

running (09.0s), 150/150 VUs, 7584 complete and 0 interrupted iterations
default   [  60% ] 150 VUs  09.0s/15s

running (10.0s), 150/150 VUs, 8535 complete and 0 interrupted iterations
default   [  66% ] 150 VUs  10.0s/15s

running (11.0s), 150/150 VUs, 9519 complete and 0 interrupted iterations
default   [  73% ] 150 VUs  11.0s/15s

running (12.0s), 150/150 VUs, 10272 complete and 0 interrupted iterations
default   [  80% ] 150 VUs  12.0s/15s

running (13.0s), 150/150 VUs, 11140 complete and 0 interrupted iterations
default   [  86% ] 150 VUs  13.0s/15s

running (14.0s), 150/150 VUs, 12014 complete and 0 interrupted iterations
default   [  93% ] 150 VUs  14.0s/15s

running (15.0s), 150/150 VUs, 12972 complete and 0 interrupted iterations
default   [ 100% ] 150 VUs  15.0s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 13159   868.96607/s
    checks_succeeded...: 100.00% 13159 out of 13159
    checks_failed......: 0.00%   0 out of 13159

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=171.1ms  min=7.63ms med=163.09ms max=704.81ms p(90)=277.01ms p(95)=310.65ms p(99)=418.34ms
      { expected_response:true }...: avg=171.1ms  min=7.63ms med=163.09ms max=704.81ms p(90)=277.01ms p(95)=310.65ms p(99)=418.34ms
    http_req_failed................: 0.00%  0 out of 13159
    http_reqs......................: 13159  868.96607/s

    EXECUTION
    iteration_duration.............: avg=171.33ms min=7.69ms med=163.22ms max=704.89ms p(90)=277.18ms p(95)=311.55ms p(99)=418.44ms
    iterations.....................: 13159  868.96607/s
    vus............................: 150    min=150        max=150
    vus_max........................: 150    min=150        max=150

    NETWORK
    data_received..................: 21 MB  1.4 MB/s
    data_sent......................: 1.8 MB 121 kB/s



running (15.1s), 000/150 VUs, 13159 complete and 0 interrupted iterations
default ✓ [ 100% ] 150 VUs  15s