docs/test/results/20260321/k6-knee/comment-vus175-after-seed.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 175 max VUs, 45s max duration (incl. graceful stop):
              * default: 175 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 175/175 VUs, 407 complete and 0 interrupted iterations
default   [   6% ] 175 VUs  01.0s/15s

running (02.0s), 175/175 VUs, 1045 complete and 0 interrupted iterations
default   [  13% ] 175 VUs  02.0s/15s

running (03.0s), 175/175 VUs, 1665 complete and 0 interrupted iterations
default   [  20% ] 175 VUs  03.0s/15s

running (04.0s), 175/175 VUs, 2377 complete and 0 interrupted iterations
default   [  26% ] 175 VUs  04.0s/15s

running (05.0s), 175/175 VUs, 3013 complete and 0 interrupted iterations
default   [  33% ] 175 VUs  05.0s/15s

running (06.0s), 175/175 VUs, 3719 complete and 0 interrupted iterations
default   [  40% ] 175 VUs  06.0s/15s

running (07.0s), 175/175 VUs, 4441 complete and 0 interrupted iterations
default   [  46% ] 175 VUs  07.0s/15s

running (08.0s), 175/175 VUs, 5174 complete and 0 interrupted iterations
default   [  53% ] 175 VUs  08.0s/15s

running (09.0s), 175/175 VUs, 5937 complete and 0 interrupted iterations
default   [  60% ] 175 VUs  09.0s/15s

running (10.0s), 175/175 VUs, 6575 complete and 0 interrupted iterations
default   [  66% ] 175 VUs  10.0s/15s

running (11.0s), 175/175 VUs, 7180 complete and 0 interrupted iterations
default   [  73% ] 175 VUs  11.0s/15s

running (12.0s), 175/175 VUs, 7987 complete and 0 interrupted iterations
default   [  80% ] 175 VUs  12.0s/15s

running (13.0s), 175/175 VUs, 8653 complete and 0 interrupted iterations
default   [  86% ] 175 VUs  13.0s/15s

running (14.0s), 175/175 VUs, 9387 complete and 0 interrupted iterations
default   [  93% ] 175 VUs  14.0s/15s

running (17.0s), 175/175 VUs, 10020 complete and 0 interrupted iterations
default   [ 100% ] 175 VUs  15.0s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 10218   592.418406/s
    checks_succeeded...: 100.00% 10218 out of 10218
    checks_failed......: 0.00%   0 out of 10218

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=291.29ms min=15.03ms med=251.35ms max=3.09s p(90)=476.21ms p(95)=587.52ms p(99)=1.45s   
      { expected_response:true }...: avg=291.29ms min=15.03ms med=251.35ms max=3.09s p(90)=476.21ms p(95)=587.52ms p(99)=1.45s   
    http_req_failed................: 0.00%  0 out of 10218
    http_reqs......................: 10218  592.418406/s

    EXECUTION
    iteration_duration.............: avg=258.28ms min=15.17ms med=249.32ms max=1.08s p(90)=448.03ms p(95)=509.78ms p(99)=649.75ms
    iterations.....................: 10218  592.418406/s
    vus............................: 175    min=175        max=175
    vus_max........................: 175    min=175        max=175

    NETWORK
    data_received..................: 333 MB 19 MB/s
    data_sent......................: 1.5 MB 89 kB/s



running (17.2s), 000/175 VUs, 10218 complete and 0 interrupted iterations
default ✓ [ 100% ] 175 VUs  15s